def shift_encode(string):
    string1: str = ''
    code = {
        'а': 'б',
        'б': 'в',
        'в': 'г',
        'г': 'д',
        'д': 'е',
        'е': 'ё',
        'ё': 'ж',
        'ж': 'з',
        'з': 'и',
        'и': 'й',
        'й': 'к',
        'к': 'л',
        'л': 'м',
        'м': 'н',
        'н': 'о',
        'о': 'п',
        'п': 'р',
        'р': 'с',
        'с': 'т',
        'т': 'у',
        'у': 'ф',
        'ф': 'х',
        'х': 'ц',
        'ц': 'ч',
        'ч': 'ш',
        'ш': 'щ',
        'щ': 'ъ',
        'ъ': 'ы',
        'ы': 'ь',
        'ь': 'э',
        'э': 'ю',
        'ю': 'я',
        'я': 'а',
        ' ': ' '
    }
    for letter in range(len(string)):
        string1 += code[string[letter]]

    return string1

def shift_decode(string):
    string2: str = ''
    code = {
        'я': 'ю',
        'ю': 'э',
        'э': 'ь',
        'ь': 'ы',
        'ы': 'ъ',
        'ъ': 'щ',
        'щ': 'ш',
        'ш': 'ч',
        'ч': 'ц',
        'ц': 'х',
        'х': 'ф',
        'ф': 'у',
        'у': 'т',
        'т': 'с',
        'с': 'р',
        'р': 'п',
        'п': 'о',
        'о': 'н',
        'н': 'м',
        'м': 'л',
        'л': 'к',
        'к': 'й',
        'й': 'и',
        'и': 'з',
        'з': 'ж',
        'ж': 'ё',
        'ё': 'е',
        'е': 'д',
        'д': 'г',
        'г': 'в',
        'в': 'б',
        'б': 'а',
        'а': 'я',
        ' ': ' '
    }
    for letter in range(len(string)):
        string2 += code[string[letter]]

    return string2

